---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.WidthParameterWarning
source: html/a7dc3a0f-981d-6d20-d687-01bc216896b2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.WidthParameterWarning Property

This is used to post warning. The "External Diameter" parameter must be set to a strictly positive value.

## Syntax (C#)
```csharp
public static FailureDefinitionId WidthParameterWarning { get; }
```